app/views/superadmins/index.html.erb

INSERT INTO `moderators` (`name`, `email`, `password`, `contact`, `superadmin_id`, `created_at`, `updated_at`) VALUES ('Akjsdnkasdjn', 'kasjdnakdsjnasdkjn', 'alksdmldkmalsdkm', '9718713131', 12, '2017-08-31 09:27:52', '2017-08-31 09:27:52')
---
  <td><%= moderator.contact%> &nbsp&nbsp&nbsp</td>
  <td><%= moderator.created_at %>  &nbsp&nbsp&nbsp</td>