app/controllers/customers_controller.rb

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
  def comment
  id=params[:id]
  @shop=Shop.find(id)

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
INSERT INTO `reviews` (`message`, `role`, `shop_id`, `created_at`, `updated_at`) VALUES ('very great shop', 'Review', 1, '2017-09-07 05:18:05', '2017-09-07 05:18:05')
---
def commented
  comment=params[:comment]
  @review=Review.new(message: comment)
  @shop=Shop.where(id: params[:shop_id]).first
  p @shop
  @shop.reviews.push(@review)

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
INSERT INTO `reviews` (`message`, `role`, `shop_id`, `comment_id`, `created_at`, `updated_at`) VALUES ('Great shop', 'Reply', 1, 1, '2017-09-07 05:18:05', '2017-09-07 05:18:05')
---
  def reply
     shop_id=params[:shop_id]
     comment_id=params[:comment_id]
     reply=params[:reply]
     @shop=Shop.where(id: shop_id).first
     @review=Review.where(id: comment_id).first
     @reply=Review.new(message: reply)
     @review.replies.push(@reply)

SELECT  `cities`.* FROM `cities` WHERE `cities`.`name` = 'Kesslerfort' ORDER BY `cities`.`id` ASC LIMIT 1
SELECT `cities`.* FROM `cities`
SELECT `areas`.* FROM `areas`
---
  def search
    if request.post?
     city=City.where(name:params[:city])
     area=Area.where(name:params[:area])
     category=Category.where(name:params[:category])
     name=params[:name]
     @shops=Shop.where(name:name,city_id:city.first.id,area_id:area.first.id,category_id:category.first.id)
     render('results')
    end
    if request.get?
      @city=City.all
      @city_names=[]
      @city.each do |city|
          @city_names.push(city.name)
      end
      @area=Area.all