app/controllers/moderators_controller.rb

  def delsale
    # getting the moderator responsible for current session sales persons
    session[:current_moderator_id]=1
    @moderator=Moderator.find_by_id(session[:current_moderator_id])
---
SELECT  `moderators`.* FROM `moderators` WHERE `moderators`.`id` = 1 LIMIT 1