app/controllers/moderators_controller.rb

SELECT `sales`.* FROM `sales` WHERE `sales`.`moderator_id` = 1
SELECT `shops`.* FROM `shops` WHERE `shops`.`sale_id` = 1
---
  def index
    @moderator=current_user
    # we get moderators that belongs to that superadmins
    @sales= @moderator.sales
    @shops=[]
    @sales.each do |sale|
          sale.shops.each do |shop|

SELECT  `superadmins`.* FROM `superadmins` ORDER BY `superadmins`.`id` ASC LIMIT 1
INSERT INTO `moderators` (`name`, `email`, `password`, `contact`, `superadmin_id`, `created_at`, `updated_at`) VALUES ('Jackson', 'jackson@123', '9175454577', '9175454577', 1, '2017-09-06 07:06:48', '2017-09-06 07:06:48')
---
  def create
   # here moderator object is created with parameters
   @moderator = Moderator.new(moderator_params)
   puts "--------------"
   # printing session variable on console
   puts session[:current_user_id]
   # searching for superadmin under which this moderator should exists
   @superadmin=Superadmin.first
   # inserting the moderator inside the superadmin
   @superadmin.moderators << @moderator

DELETE FROM `sales` WHERE `sales`.`id` = 1
SELECT  `sales`.* FROM `sales` WHERE `sales`.`moderator_id` = 2 AND `sales`.`id` = 1 LIMIT 1
---
  def delsale
    # getting the moderator responsible for current session sales persons
    @moderator=current_user
    # we get salesperson that belongs to that moderator
    @sales = @moderator.sales
    # we see if a delete is pressed bcz on delete pressed we will get id in the link
    if params[:id]
      # deleting the particular sale person
      Sale.find(params[:id]).destroy

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
UPDATE `shops` SET `approve` = 1, `updated_at` = '2017-09-06 07:29:58' WHERE `shops`.`id` = 1
---
  def approve
    @shop=Shop.where(id:params[:id]).first
    @shop.approve_status='1'
    @shop.save

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
DELETE FROM `shops` WHERE `shops`.`id` = 1
---
   def remove
     @shop=Shop.find(params[:id])
     @shop.destroy

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
   def reject
     @shop=Shop.where(id:params[:id]).first