app/controllers/sales_controller.rb

SELECT  `cities`.* FROM `cities` WHERE `cities`.`name` = 'Pune' ORDER BY `cities`.`id` ASC LIMIT 1
SELECT  `areas`.* FROM `areas` WHERE `areas`.`name` = 'Baner' ORDER BY `areas`.`id` ASC LIMIT 1
SELECT  `categories`.* FROM `categories` WHERE `categories`.`name` = 'Retail' ORDER BY `categories`.`id` ASC LIMIT 1
SELECT  `sales`.* FROM `sales` WHERE `sales`.`id` = 1 LIMIT 1
INSERT INTO `shops` (`name`, `city_id`, `area_id`, `sale_id`, `category_id`, `created_at`, `updated_at`) VALUES ('Reebok Showroom', 1, 1, 1, 1, '2017-09-07 05:18:06', '2017-09-07 05:18:06')
SELECT `cities`.* FROM `cities`
SELECT `areas`.* FROM `areas`
SELECT `categories`.* FROM `categories` WHERE `categories`.`role` = 'Category'
---
  def newShop
  if request.post?
    @shop=Shop.new(name: params[:name])
     city=City.where(name: params[:city]).first
     area=Area.where(name: params[:area]).first
     category=Category.where(name: params[:category]).first
     sale=Sale.find('1')
     sale.shops.push(@shop)
     city.shops.push(@shop)
     area.shops.push(@shop)
     category.shops.push(@shop)
    redirect_to(sales_url)
  end
 if request.get?
   @city_names=[]
   City.all.each do |city|
     @city_names.push(city.name)
   end
   @area_names=[]
   Area.all.each do |area|
     @area_names.push(area.name)
   end
   @category_names=[]
   Category.where(role:'Category').each do |category|

SELECT  `moderators`.* FROM `moderators` WHERE `moderators`.`id` IS NULL LIMIT 1
INSERT INTO `sales` (`name`, `email`, `password`, `contact`, `moderator_id`, `created_at`, `updated_at`) VALUES ('Kasjdkajsdnakas', 'kasdjnasaskjdnasdkjn', 'aksjdnaksdjsn', '+91 1273617251', 2, '2017-08-31 12:54:11', '2017-08-31 12:54:11')
UPDATE `moderators` SET `name` = 'Adadadasda', `updated_at` = '2017-08-31 12:54:11' WHERE `moderators`.`id` = 2
---
  def create
     @sale=Sale.new(sale_params)
     @moderator=Moderator.find_by_id(session[:current_moderator_id])
     @moderator.sales << @sale
    if @moderator.save!

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 ORDER BY `shops`.`id` ASC LIMIT 1
SELECT  `cities`.* FROM `cities` WHERE `cities`.`name` = 'Pune' ORDER BY `cities`.`id` ASC LIMIT 1
SELECT  `areas`.* FROM `areas` WHERE `areas`.`name` = 'Baner' ORDER BY `areas`.`id` ASC LIMIT 1
SELECT  `categories`.* FROM `categories` WHERE `categories`.`name` = 'Retail' AND `categories`.`role` = 'Category' ORDER BY `categories`.`id` ASC LIMIT 1
UPDATE `shops` SET `name` = 'Renault Showroom', `updated_at` = '2017-09-07 05:18:06' WHERE `shops`.`id` = 1
SELECT `cities`.* FROM `cities`
SELECT `areas`.* FROM `areas`
SELECT `categories`.* FROM `categories` WHERE `categories`.`role` = 'Category'
---
  def edit
    if request.post?
    p "-------------"+params[:shop_id]
    @shop=Shop.where(id:params[:shop_id]).first
    @city=City.where(name:params[:city]).first
    @area=Area.where(name:params[:area]).first
    @category=Category.where(name:params[:category],role:'Category').first
    @city.shops.push(@shop)
    @area.shops.push(@shop)
    @category.shops.push(@shop)
    @shop.update(name:params[:name])
    redirect_to(sales_url)
    end
    if request.get?
    @shop=Shop.find(params[:id])
    @city_names=[]
    City.all.each do |city|
    @city_names.push(city.name)
    end
    @area_names=[]
    Area.all.each do |area|
    @area_names.push(area.name)
    end
    @categories=Category.where(role: "Category")

DELETE FROM `shops` WHERE `shops`.`id` = 1
SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
  def remove
   Shop.find(params[:id]).destroy