app/controllers/superadmins_controller.rb

def delmod
  @superadmin=Superadmin.first
  # we get moderators that belongs to that superadmins
  @moderators= @superadmin.moderators
 if params[:id]
   @moderators.find_by_id(params[:id]).destroy
---
SELECT  `superadmins`.* FROM `superadmins` ORDER BY `superadmins`.`id` ASC LIMIT 1
DELETE FROM `moderators` WHERE `moderators`.`id` = 1
SELECT  `moderators`.* FROM `moderators` WHERE `moderators`.`superadmin_id` = 1 AND `moderators`.`id` = 1 LIMIT 1

  def create
     # created new instance variable for superadmin class
     @superadmin=Superadmin.new(superadmin_params)
     # checking if the superadmin saves into the superadmins table
     if @superadmin.save!
---
INSERT INTO `superadmins` (`name`, `email`, `password`, `contact`, `created_at`, `updated_at`) VALUES ('Jackson', 'jackson@123', '9175454577', '9175454577', '2017-09-06 06:21:26', '2017-09-06 06:21:26')